# Pandas

## Índice

1 [Carragar bases](#1.-Carregar-bases)<br>
&nbsp;&nbsp;&nbsp;&nbsp; 1.1 [Carregar CSV](#1.1-Carregar-CSV)<br>
&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp; 1.1.1 [Carregar CSV separado por ponto e vírgula](#1.1.1-Carregar-CSV-separado-por-ponto-e-vírgula)<br>
&nbsp;&nbsp;&nbsp;&nbsp; 1.2 [Carregar Excel](#1.2-Carregar-Excel)<br>
&nbsp;&nbsp;&nbsp;&nbsp; 1.3 [Carregar Tabela HTML](#1.3-Carregar-tabela-HTML-da-web)<br>

2 [Criando Dataframes e Series](#2-Criando-Dataframes-e-Series)<br>
&nbsp;&nbsp;&nbsp;&nbsp; 2.1 [Criando Series](#2.1-Criando-Series)<br>
&nbsp;&nbsp;&nbsp;&nbsp; 2.2 [Criando Dataframes](#2.2-Criando-Dataframes)<br>

3 [Resolvendo problemas com acentos](#3-Resolvendo-problemas-com-acentos)<br>

4 [Alterando nome das colunas](#4-Alterando-nome-das-colunas)<br>

<br><br>3 (Em construção)<br><br>
4 (Em construção)<br><br>
5 (Em construção)<br><br>
6 (Em construção)<br><br>
7 (Em construção)<br><br>

Algumas funções (Em construção):
- unique e nunique 
- describe
- sort_values
- value_counts
- isnull 
- fillna 
- groupby 
- map
- apply e lambda
- pivot

#### Importando o Pandas

In [2]:
import pandas as pd

## 1. Carregar bases
[Voltar para o índice](#Índice)

### 1.1 Carregar CSV
[Voltar para o índice](#Índice)

In [3]:
base = pd.read_csv('../../arquivos_e_bases/arquivo_csv.csv')
base

,Nome,Email,Telefone,Cidade,Estado
0,Silvio Monte,silvio@silviomonte.com.br,(81) 99215.2084,Recife,PE
1,Indra Escobar,indra@escobar.com,(81) 98655.2356,Arcoverde,PE
2,Jack Johnson,jack@jackjohnson.com,(83) 32566.6536,Jo�o Pessoa,PB
3,Jimmy Hendrix,jummy@nonemail.com,(11) 36523.1576,S�o Paulo,SP

#### 1.1.1 Carregar CSV separado por ponto e vírgula
[Voltar para o índice](#Índice)

In [6]:
base = pd.read_csv('../../arquivos_e_bases/arquivo_csv_separado_por_ponto_e_virgula.csv', sep=';')
base

,Nome,Email,Telefone,Cidade,Estado
0,Silvio Monte,silvio@silviomonte.com.br,(81) 99215.2084,Recife,PE
1,Indra Escobar,indra@escobar.com,(81) 98655.2356,Arcoverde,PE
2,Jack Johnson,jack@jackjohnson.com,(83) 32566.6536,Jo�o Pessoa,PB
3,Jimmy Hendrix,jummy@nonemail.com,(11) 36523.1576,S�o Paulo,SP

### 1.2 Carregar Excel
[Voltar para o índice](#Índice)

In [4]:
base = pd.read_excel('../../arquivos_e_bases/arquivo_excel.xlsx')
base

,Nome,Email,Telefone,Cidade,Estado
0,Silvio Monte,silvio@silviomonte.com.br,(81) 99215.2084,Recife,PE
1,Indra Escobar,indra@escobar.com,(81) 98655.2356,Arcoverde,PE
2,Jack Johnson,jack@jackjohnson.com,(83) 32566.6536,João Pessoa,PB
3,Jimmy Hendrix,jummy@nonemail.com,(11) 36523.1576,São Paulo,SP

### 1.3 Carregar tabela HTML da web
[Voltar para o índice](#Índice)

In [7]:
url = 'https://pt.wikipedia.org/wiki/Discagem_direta_%C3%A0_dist%C3%A2ncia'
tabelas = pd.read_html(url)
len(tabelas)

2

In [9]:
tabelas[0]

    Prefixo     Estado                       Cidades principais / Regiões
0        11  São Paulo  Região Metropolitana de São Paulo/Região Metro...
1        12  São Paulo  Região Metropolitana do Vale do Paraíba e Lito...
2        13  São Paulo  Região Metropolitana da Baixada Santista/Vale ...
3        14  São Paulo     Avaré/Bauru/Botucatu/Jaú/Lins/Marília/Ourinhos
4        15  São Paulo                Itapetininga/Itapeva/Sorocaba/Tatuí
..      ...        ...                                                ...
62       95    Roraima                       Abrangência em todo o estado
63       96      Amapá                       Abrangência em todo o estado
64       97   Amazonas                  Abrangência no interior do estado
65       98   Maranhão                    São Luís e Região Metropolitana
66       99   Maranhão                             Caxias/Codó/Imperatriz

[67 rows x 3 columns]

In [10]:
tabelas[1]

    0                                                  1
0 NaN  Este artigo sobre telefonia é um esboço. Você ...

## 2 Criando Dataframes e Series
[Voltar para o índice](#Índice)

### 2.1 Criando Series

Series é um conjunto de dados que só pode ter uma única dimensão, ou seja, uma única coluna
<br>[Voltar para o índice](#Índice)

In [8]:
series = pd.Series(['Silvio Monte', 'Indra Escobar', 'Neide Muhlert', 'Arturo Escobar'],
                     index=['Marido', 'Esposa', 'Mãe', 'Sogro'])
series

Marido      Silvio Monte
Esposa     Indra Escobar
Mãe        Neide Muhlert
Sogro     Arturo Escobar
dtype: object

In [ ]:
series = pd.Series(['Silvio Monte', 'Indra Escobar', 'Neide Muhlert', 'Arturo Escobar'])
series

### 2.2 Criando Dataframes

Dataframes é um conjunto de dados que pode ter uma ou mais dimensões, ou seja, pode conter várias colunas
<br>[Voltar para o índice](#Índice)

In [6]:
dataframe = pd.DataFrame(['Silvio Monte', 'Indra Escobar', 'Neide Muhlert', 'Arturo Escobar'])
dataframe

                0
0    Silvio Monte
1   Indra Escobar
2   Neide Muhlert
3  Arturo Escobar

In [7]:
dataframe = pd.DataFrame(['Silvio Monte', 'Indra Escobar', 'Neide Muhlert', 'Arturo Escobar'],
                     index=['Marido', 'Esposa', 'Mãe', 'Sogro'])
dataframe

                     0
Marido    Silvio Monte
Esposa   Indra Escobar
Mãe      Neide Muhlert
Sogro   Arturo Escobar

In [10]:
data = {'Nome' : ['Silvio Monte', 'Indra Escobar', 'Neide Muhlert', 'Arturo Escobar'],
                     'Parentesco': ['Marido', 'Esposa', 'Mãe', 'Sogro']}
dataframe = pd.DataFrame(data)
dataframe

             Nome Parentesco
0    Silvio Monte     Marido
1   Indra Escobar     Esposa
2   Neide Muhlert        Mãe
3  Arturo Escobar      Sogro

## 3 Resolvendo problemas com acentos
[Voltar para o índice](#Índice)

In [11]:
base = pd.read_csv('../../arquivos_e_bases/arquivo_csv.csv', encoding='latin1')
base

## 4 Alterando nome das colunas
[Voltar para o índice](#Índice)

In [10]:
base = pd.read_csv('../../arquivos_e_bases/arquivo_csv.csv', names=['nome_completo', 'email', 'telefone_com_ddd', 'cidade', 'uf'])
base

,nome_completo,email,telefone_com_ddd,cidade,uf
0,Nome,Email,Telefone,Cidade,Estado
1,Silvio Monte,silvio@silviomonte.com.br,(81) 99215.2084,Recife,PE
2,Indra Escobar,indra@escobar.com,(81) 98655.2356,Arcoverde,PE
3,Jack Johnson,jack@jackjohnson.com,(83) 32566.6536,Jo�o Pessoa,PB
4,Jimmy Hendrix,jummy@nonemail.com,(11) 36523.1576,S�o Paulo,SP